<template>
<label for="name" class="mb-2 block text-gray-700">이용약관</label>
<textarea 
    readonly 
    class="border rounded p-4 w-full h-64 text-[14px] overflow-y-scroll"
>
ROAM XR7 사전예약 할인판매 약관

제 1조 [ 목적 ]
이 약관은 주식회사 뉴클라베 (이하 "회사")가 제공하는 ROAM XR7(이하 "상품")의 사전예약 할인판매(이하 "사전예약")와 관련하여 회사와 구매자 간의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.

제 2조 [ 정의 ]
1. "사전예약 할인판매"란 회사가 상품을 공식 출시 전 일정 기간 동안 구매 예약을 받는 것을 의미합니다.
2. "구매자"란 사전예약을 통해 상품을 예약하고자 하는 고객을 의미합니다.

제 3조 [ 사전예약 신청 ]
1. 구매자는 회사의 사전예약 신청 페이지에서 제공되는 절차에 따라 사전예약을 신청할 수 있습니다.
2. 사전예약 신청 시 구매자는 정확한 개인정보 및 결제 정보를 입력해야 하며, 허위 정보 입력으로 인한 불이익은 구매자 본인이 책임집니다.
3. 사전예약 신청 종료일은 2024년 10월 30일까지 입니다.

제 4조 [ 결제 ]
1. 사전예약 시 구매자는 회사가 제공하는 계좌로 현금결제를 진행해야 합니다.
2. 사전예약은 구매자의 결제가 완료된 이후 확정됩니다.
3. 구매자는 사전예약 판매기간 종료시점까지 주문취소가 불가합니다.

제 5조 [ 배송 ]
사전예약 상품의 배송은 사전예약 기간 종료 후 일괄 배송하며, 제조사 상황 및 수입 절차와 국내 전파인증 등에 따라 구체적인 배송일정은 추후 공지합니다.

제 6조 [ 환불 정책 ]
1. 사전예약 기간 중에는 환불처리는 불가합니다.
2. 제품 배송 후 7일 이내 단순변심에 의한 주문취소가 가능하며, 이 경우 위약금 20%가 발생합니다.

제 7조 [ 상품 보증 ]
1. 상품의 품질보증 기간은 상품 수령일로부터 1년이며, 보증 기간 내 발생한 상품의 하자에 대해서는 회사가 무상 교환 및 수리를 제공합니다.
2. 보증 기간 외에 발생하는 수리나 교환은 유상으로 진행됩니다.

제 8조 [ 개인정보 보호 ]
1. 회사는 사전예약 신청 시 수집된 개인정보를 상품 배송 및 고객 서비스 제공 목적으로만 사용하며, 관련 법령에 따라 개인정보를 보호합니다.
2. 구매자는 개인정보 변경 시 회사에 즉시 통보해야 하며, 통보 지연으로 인한 문제에 대해서는 회사가 책임지지 않습니다.

제 9조 [ 기타 ]
1. 이 약관에서 정하지 않은 사항에 대해서는 관련 법령 또는 상관례에 따릅니다.
2. 회사는 약관을 변경할 수 있으며, 약관 변경 시 사전 공지 후 적용됩니다.

부칙
- 이 약관은 2024년 9월 부터 시행됩니다.
</textarea>
</template>